Tekla Open API Reference for Tekla Structures 2025
DrawingItem Properties
The DrawingItem type exposes the following members.
Properties
Name | Description
Files
 The files belonging to drawing item.
Name
 The drawing item's name.
Type
 The files belonging to drawing item.
Top
See Also
Reference
DrawingItem Class
Tekla.Structures.Catalogs Namespace